[
    {
        "id": 21,
        "name": "Eternal Love",
        "director": "Lam Yuk Fan, Yu Cuihua, Ren Haitao",
        "casts": [
            "Yang Mi",
            "Mark Chao",
            "Ken Chang",
            "Zhang Gong",
            "Ma Rui",
            "Leng Haiming",
            "Vengo Gao"
        ],
        "totalEpisodes": 58,
        "description": "The Nine-tailed Fox Bai Qian, the youngest daughter of the Fox King, is brought to Kunlun Mountain to become a disciple of the God of War, Mo Yuan. While studying there, a war breaks out that leads to Mo Yuan sacrificing his life to seal a demon lord. Seventy thousand years later, Bai Qian attempts to also sacrifice herself to re-seal the demon lord but is instead thrown to the mortal realm where she loses all her memories and divine power. Living alone on a remote mountain, Bai Qian saves Crown Prince Ye Hua of the Nine Heavens, who is actually her fiancé in Heaven and greatly resembles the late Mo Yuan. The two start falling in love, not knowing the true identity of the other person and their love tribulation that involves them meeting in three different lives and three worlds.",
        "avatarName": "eternal-love",
        "trailerName": "eternal-love",
        "rating": 8.9,
        "yearOfRelease": "2017"
    },
    {
        "id": 22,
        "name": "Ashes Of Love",
        "director": "Chu Yui Bun, Cheng Feng",
        "casts": [
            "Yang Zi",
            "Deng Lun",
            "Luo Yun Xi",
            "Wang Yi Fei",
            "Chen Yu Qi",
            "Zhou Ting Wei"
        ],
        "totalEpisodes": 63,
        "description": "Four thousand years ago, when Jin Mi was born, her fate was already sealed. She is to be a prisoner in Shui Jing. Mi's mother Zi Fen, a flower deity, abandons her for the afterlife. Near death, Fen feeds her infant daughter the ‘unfeeling pill’ and orders her subordinates to keep her identity a secret from Mi. Four thousand years later, Xu Feng, the second son of the Heavenly King and fire deity, is caught in an enemy trap, leading him to Shui Jing, where Mi comes to his rescue. Over the following century, these fated souls find comfort in one another.",
        "avatarName": "ashes-of-love",
        "trailerName": "ashes-of-love",
        "rating": 8.7,
        "yearOfRelease": "2018"
    },
    {
        "id": 23,
        "name": "My Sunshine",
        "director": "Liu Jun Jie",
        "casts": [
            "Tiffany Tang",
            "Wallace Chung",
            "Tan Kai",
            "Eric Le Yang",
            "Viola Mi",
            "Zang Hong Na"
        ],
        "totalEpisodes": 32,
        "description": "Zhao Mo Sheng is a university student with a sunny disposition, she's smart, and has a positive personality. Upon their first meeting, she fell in love with He Yi Chen, one of the top students from the Law faculty. He Yi Chen gradually warmed up to her and they became a loving couple. One day he abruptly breaks up with her and she is forced by her father to depart overseas without ever getting an explanation from Yi Chen. Seven years later, Zhao Mo Sheng returns home and spots him immediately in a crowded supermarket. As their paths inevitably continue to cross in present time, details and secrets regarding their break-up and the years in between are revealed.  Will the two college sweethearts be able to reunite?",
        "avatarName": "my-sunshine",
        "trailerName": "my-sunshine",
        "rating": 7.9,
        "yearOfRelease": "2015"
    },
    {
        "id": 24,
        "name": "Boss & Me",
        "director": "Liu Jun Jie",
        "casts": [
            "Zhao Li Ying",
            "Zhang Han",
            "Huang You Ming",
            "Li Cheng Yuan",
            "Zhang Yang Guo Er",
            "Bai Ke Li"
        ],
        "totalEpisodes": 34,
        "description": "Big conglomerate president Feng Teng has a younger sister, with a very rare blood type, who needs a transfusion. He finds an employee at his company named Xue Shan Shan and asks her for a blood donation. Afterwards brother and sister are rather indebted to Shan Shan, but rather than using Feng Teng's typical method of paying her off, his sister suggests sending her nutritious packed lunches so Shan Shan can recover from the blood loss and to make the thank you more personal. Shan Shan loves to eat and her enjoyment of the lunches, along with her general bright and sunny personality, slowly start melting cold Feng Teng's heart.",
        "avatarName": "boss-and-me",
        "trailerName": "boss-and-me",
        "rating": 8.1,
        "yearOfRelease": "2014"
    },
    {
        "id": 25,
        "name": "Love O2O",
        "director": "Lin Yu Fen, Guo Hu",
        "casts": [
            "Yang Yang",
            "Zheng Shuang",
            "Zheng Ye Cheng",
            "Cui Hang",
            "Niu Jun Feng",
            "Vin Zhang"
        ],
        "totalEpisodes": 30,
        "description": "Xiao Nai is a gaming expert who, courtesy of his basketball skills, academic excellence, swimming talent and game company presidency, also happens to be the most popular student on campus. When he first comes across the gorgeous computer science major Bei Wei Wei, the infinitely talented wunderkind immediately falls in love. But it’s not Wei Wei’s looks that he notices; it’s the ridiculous mastery with which she is commanding her guild and owning everyone in an online multiplayer game that makes her impossible to forget. Now, Xiao Nai must use his skills both in real life and online to capture the adorable but dorky Wei Wei’s heart. But does their love have the XP to succeed, or will this relationship never level up?",
        "avatarName": "love-o2o",
        "trailerName": "love-o2o",
        "rating": 8.4,
        "yearOfRelease": "2016"
    },
    {
        "id": 26,
        "name": "You Are My Glory",
        "director": "Wang Zhi",
        "casts": [
            "Yang Yang",
            "Dilraba Dilmurat",
            "Pan Yue Ming",
            "Hu Ke",
            "Wang Yan Lin",
            "Sun Ya Li"
        ],
        "totalEpisodes": 32,
        "description": "A story that follows an aerospace engineer Yu Tu and the shining star Qiao Jing Jing. A decision is made to start gaming in order to save her endorsement deal brings her face to face with an old crush. As they grow closer, the two forge ahead to become each other's glory. Being a well-known celebrity, Qiao Jing Jing has to keep up with appearances in order to maintain her multi-faceted image. Alas, one starts to crack when someone leaks a video of her playing an online game and being terrible at it which is completely inconsistent with the image she has created for herself as the game's ambassador. Thus, she joins a gaming competition to prove her skills and to prevent herself from losing her endorsements. Qiao Jing Jing decides to use all of her free time towards improving her game and her decision leads her to reconnect with her old high school classmate, Yu Tu, whom she once had a crush on. He was a legend at their school, outstanding in everything that he does, while Qiao Jing Jing was just your average girl. Yu Tu went on to become an aerospace engineer who is also an expert gamer. It seems that the online game brought them together once more so she asks him to become her gaming coach.",
        "avatarName": "you-are-my-glory",
        "trailerName": "you-are-my-glory",
        "rating": 8.8,
        "yearOfRelease": "2021"
    },
    {
        "id": 27,
        "name": "Love Me, If You Dare",
        "director": "Zhang Kai Zhou",
        "casts": [
            "Wallace Huo",
            "Ma Si Chun",
            "Edward Zhang",
            "Yin Zheng",
            "Wang Kai",
            "Zhang Ling Zhi"
        ],
        "totalEpisodes": 24,
        "description": "Getting inside the head of a violent criminal is not easy. But Simon, Bo Jinyan, a brilliant criminal psychologist, has the ability to get into the minds of even the most mysterious and violent criminals. He was a professor at The University of Maryland and works as an analyst and advisor on the police department’s most violent or difficult cases. With the help of his young assistant, Jenny Jian Yao, Simon delves into the thoughts and intentions of the criminal mind. As the daughter of a veteran police investigator with a deep sense of justice, can Jenny help Simon open up emotionally as they work together to solve crimes? ",
        "avatarName": "love-me-if-you-dare",
        "trailerName": "love-me-if-you-dare",
        "rating": 8.4,
        "yearOfRelease": "2015"
    },
    {
        "id": 28,
        "name": "Go Go Squid!",
        "director": "Lee Ching Jung",
        "casts": [
            "Yang Zi",
            "Li Xian",
            "Hu Yi Tian",
            "Lee Hong Chi",
            "Li Ze Feng",
            "Chen Xi Jun"
        ],
        "totalEpisodes": 41,
        "description": "Han Shang Yan, a former legend in the CTF cyber-security esports world, had long retired to set up his own esports club, K&K, to train a group of young teenage boys as professional esports athletes. One evening, after a K&K loss at a CTF competition, Han Shang Yan walks into an internet cafe to cool off. A computer science genius and part-time online singer, Tong Nian had been helping her cousin man his internet cafe one evening when Han Shang Yan walks in and she immediately falls for him at first sight. Usually brave, outgoing, and having tens of thousands of followers from singing covers online, she finds herself wanting to get close to him and makes several clumsy attempts to do so. A further series of coincidences and misunderstandings throw the both of them together and, as Han Shang Yan slowly starts to soften towards her, Tong Nian also finds herself getting involved in K&K's activities and the world of professional esports, even uncovering the past about Han Shang Yan and the reason for his sudden retirement from the esports world.",
        "avatarName": "go-go-squid",
        "trailerName": "go-go-squid",
        "rating": 8.5,
        "yearOfRelease": "2019"
    },
    {
        "id": 29,
        "name": "Skate Into Love",
        "director": "Chu Yui Bun",
        "casts": [
            "Zhang Xin Cheng",
            "Janice Wu",
            "Zhou Zhan",
            "Vincent Wei",
            "Chu Yue",
            "Han Jiu Nuo"
        ],
        "totalEpisodes": 40,
        "description": "A shorttrack speed skating girl crosses paths with the ice hockey god of their school. Despite starting off on the wrong foot, they start on a journey to chase after their dreams. During elementary school, the timid and cowardly Li Yu Bing had to endure his seatmate Tang Xue's constant bullying. Even so, they share one thing in common, a dream on the ice. When they meet again at Lin Da University, Li Yu Bing has become the school's ice god while Tang Xue's future remains hazy. Li Yu Bing pulls a few strings to turn Tang Xue into his helper with the goal of getting payback for everything that she did. The more they spend time together, the more Li Yu Bing notices Tang Xue's good qualities. He realizes that his courage on ice is inspired by Tang Xue herself. In turn, he helps Tang Xue rediscover her dream in speed skating. Problems arise when misunderstandings from the past catch up to them. Figure skating prodigy Yu Yan enters the picture. Tang Xue's first love Bian Cheng also returns all while school beauty Zhou Ran continues to make trouble. As they face roadblocks from disapproving parents and fierce competitors, they land in the crossroad that will decide their sports career. As the two impassioned youths put on their skates, they glide into the unknown but exciting future ahead. ",
        "avatarName": "skate-into-love",
        "trailerName": "skate-into-love",
        "rating": 8.5,
        "yearOfRelease": "2020"
    },
    {
        "id": 30,
        "name": "You Are My Hero",
        "director": "Zhang Tong",
        "casts": [
            "Ma Si Chun",
            "Bai Jing Ting",
            "Chen Hao",
            "Jiang Pei Yao",
            "Wang Yang",
            "Zhang Yao"
        ],
        "totalEpisodes": 40,
        "description": "Freshly graduated doctor Mi Ka was at a jewellery store to purchase a gift for her parents when a jewel heist by armed robbers occurred. A special SWAT team was deployed to take control of the situation and this was how Mi Ka met Special Forces Captain Xing Ke Lei when he helped diffuse an explosive situation. However, because Xing Ke Lei was in full combat uniform and had his face masked, she did not know what he looked like. A few years later, when finalising her qualifications to be a full medical surgeon, Mi Ka decides to participate in a joint emergency rescue training exercise between her hospital & the police SWAT team and she unknowingly meets Captain Xing Ke Lei again. A relationship between them begins and eventually develops as they grow to learn more about each other and as they encounter various military and medical situations in future. ",
        "avatarName": "you-are-my-hero",
        "trailerName": "you-are-my-hero",
        "rating": 8.7,
        "yearOfRelease": "2021"
    }
]
