[
    {
        "id": 1,
        "name": "Extraordinary Attorney Woo",
        "director": "Yoo In Shik",
        "casts": [
            "Park Eun Bin",
            "Kang Tae Oh",
            "Kang Ki Young",
            "Jeon Bae Soo",
            "Baek Ji Won"
        ],
        "totalEpisodes": 16,
        "description": "Extraordinary Attorney Woo tells the story of Woo Young Woo (Park Eun Bin), an autistic lawyer, working at a large law firm. She has a high IQ of 164, outstanding memory, and a creative way of thinking, however she has low emotional intelligence and poor social skills",
        "avatarName": "woo-young-woo",
        "trailerName": "woo-young-woo",
        "rating": 9.2,
        "yearOfRelease": "2022"
    },
    {
        "id": 2,
        "name": "Crash Landing On You",
        "director": "Lee Jung Hyo",
        "casts": [
            "Hyun Bin",
            "Son Ye Jin",
            "Seo Ji Hye",
            "Kim Jung Hyun",
            "Oh Man Seok",
            "Kim Young Min",
            "Kim Jung Nan",
            "Kim Sun Young"
        ],
        "totalEpisodes": 16,
        "description": "Yoon Se Ri (Son Ye Jin) is an heiress to a conglomerate in South Korea. One day, while paragliding, an accident caused by strong winds leads Yoon Se Ri to make an emergency landing in North Korea. There, she meets Ri Jeong Hyeok (Hyun Bin), who is a North Korean army officer. He tries to protect her and hide her. Soon, Ri Jeong Hyeok falls in love with Yoon Se Ri.",
        "avatarName": "crash-landing-on-you",
        "trailerName": "crash-landing-on-you",
        "rating": 9.0,
        "yearOfRelease": "2019-2020"
    },
    {
        "id": 3,
        "name": "Descendants Of The Sun",
        "director": "Lee Eung Bok, Baek Sang Hoon",
        "casts": [
            "Song Joong Ki",
            "Song Hye Kyo",
            "Jin Goo",
            "Kim Ji Won",
            "Onew",
            "Kim Min Seok",
            "Lee Seung Joon"
        ],
        "totalEpisodes": 16,
        "description": "When the captain of a Korean special forces unit, Yoo Shi Jin (Song Joong Ki), catches a thief on his day off alongside his friend and fellow soldier Seo Dae Young (Jin Goo), he has a chance encounter with a hospital trauma surgeon, Kang Mo Yeon (Song Hye Kyo). Although he immediately falls for her, Mo Yeon mistakenly believes Shi Jin is a part of the thief’s criminal gang, but after he proves the truth, they begin an unlikely relationship. Yet it doesn't take long for the couple to realize they have conflicting views on human life – with Shi Jin having to kill to protect lives while Mo Yeon does everything she can to save them. After they decide that these philosophical differences are too much to overcome, they decide to end their relationship and Shi Jin is deployed to the fictional war-torn country of Uruk. Some months later, Mo Yeon is put in the awkward position of rebuffing her hospital director’s advances. As revenge, she is assigned to a team of medical volunteers who travel to Uruk, setting up a reunion with Shi Jin where they bond over their differences and discover how powerful love can be.",
        "avatarName": "descendants-of-the-sun",
        "trailerName": "descendants-of-the-sun",
        "rating": 8.7,
        "yearOfRelease": "2016"
    },
    {
        "id": 4,
        "name": "The Heirs",
        "director": "Kang Shin Hyo, Boo Sung Chul",
        "casts": [
            "Lee Min Ho",
            "Park Shin Hye",
            "Kim Woo Bin",
            "Kim Ji Won",
            "Krystal Jung",
            "Kang Ha Neul",
            "Park Hyung Sik",
            "Jeon Soo Jin"
        ],
        "totalEpisodes": 20,
        "description": "The series follows a group of wealthy, privileged high school students as they are about to take over their families' business empires, overcoming difficulties and growing every step of the way. Kim Tan (Lee Min-ho) is a wealthy heir to a large Korean conglomerate called Jeguk Group. He was exiled to the U.S. by his half-brother Kim Won (Choi Jin-hyuk), who tries to take control of the family business. While in the States, he meets Cha Eun-sang (Park Shin-hye), who went there to look for her sister. Despite being engaged to Yoo Rachel (Kim Ji-won), a fellow heiress, Kim Tan, soon falls in love with Eun-sang. When Kim Tan returns to Korea, his former best friend turned enemy Choi Young-do (Kim Woo-bin) begins picking on Eun-sang to irritate Tan. Tension ensues when Young-do also falls in love with Eun-sang, and Kim Tan is forced to choose between his responsibility of pursuing the family business or love.",
        "avatarName": "the-heirs",
        "trailerName": "the-heirs",
        "rating": 7.6,
        "yearOfRelease": "2013"
    },
    {
        "id": 5,
        "name": "Vincenzo",
        "director": "Kim Hee Won",
        "casts": [
            "Song Joong Ki",
            "Jeon Yeo Been",
            "Ok Taec Yeon",
            "Kim Yeo Jin",
            "Kwak Dong Yeon",
            "Jo Han Chul"
        ],
        "totalEpisodes": 20,
        "description": "At the age of eight, Park Joo-hyung (Song Joong-ki) was adopted by an Italian family. He later joins the mafia and is adopted by Don Fabio, head of the Cassano Family. Renamed “Vincenzo Cassano” he becomes a lawyer, a consigliere for the mafia, and Don Fabio's right-hand man. After Fabio dies, Paolo, Fabio's biological son and the new leader of the Cassano Family attempts to kill Vincenzo. He flees to Seoul and sets out to recover 1.5 tons of gold that he helped a recently-dead Chinese tycoon secretly stash within the basement of Geumga Plaza. However, a subsidiary of Babel Group has illegally taken ownership of the building, and Vincenzo must use his skills to reclaim the building and recover his fortunes. Among the quirky tenants at Geumga Plaza is the Jipuragi Law Firm run by Hong Yoo-chan (Yoo Jae-myung) in which Vincenzo finds he has aligned interests. At first he comes into conflict with Hong Yoo-chan's daughter, Hong Cha-young (Jeon Yeo-been), an attorney for a rival firm, but after her father's death she takes over the practice and joins forces with Vincenzo and the other tenants to fight Babel Group.",
        "avatarName": "vincenzo",
        "trailerName": "vincenzo",
        "rating": 9.0,
        "yearOfRelease": "2021"
    },
    {
        "id": 6,
        "name": "Weightlifting Fairy Kim Bok Joo",
        "director": "Oh Hyun Jong",
        "casts": [
            "Lee Sung Kyung",
            "Nam Joo Hyuk",
            "Lee Jae Yoon",
            "Kyung Soo Jin",
            "Cho Hye Jung",
            "Ji Il Joo",
            "Kim Jae Hyun",
            "Kim Woo Hyuk"
        ],
        "totalEpisodes": 16,
        "description": "Kim Bok joo (Lee Sung-Kyung), a young woman chasing her dream of weightlifting on an athlete college campus, develops a crush on her friend Jung Joon-Hyung's (Nam Joo-Hyuk) older brother, Jung Jae-Yi (Lee Jae-Yoon). At first, Joon Hyung teases her and goes along with her act, even helping her, but soon finds himself falling in love with her. This series is a coming-of-age story about a group of college athletes who are fighting for their dreams, experiencing and finding love in the process, and growing every step of the way.",
        "avatarName": "weightlifting-fairy-kim-bok-joo",
        "trailerName": "weightlifting-fairy-kim-bok-joo",
        "rating": 8.8,
        "yearOfRelease": "2016-2017"
    },
    {
        "id": 7,
        "name": "Twenty Five Twenty One",
        "director": "Jung Ji Hyun",
        "casts": [
            "Kim Tae Ri",
            "Nam Joo Hyuk",
            "Bona",
            "Choi Hyun Wook",
            "Lee Joo Myung"
        ],
        "totalEpisodes": 16,
        "description": "In a time when dreams seem out of reach, a teen fencer pursues big ambitions and meets a hardworking young man who seeks to rebuild his life. At ages 22 and 18, they say each other's names for the first time, and at ages 25 and 21, they fall in love. In 1998, Na Hee-do (Kim Tae-ri) is a member of the school fencing team at Seonjung Girls' High School, but due to the IMF crisis, the team is disbanded. To continue pursuing her passion, she transfers to Taeyang High School and later manages to become a member of the National Fencing Team. Baek Yi-jin’s (Nam Joo-hyuk) family goes from \"riches to rags\" and is separated due to the financial crisis. He is forced to take up several part-time jobs and later becomes a sports reporter. In present day, Kim Min-chae (Choi Myung-bin), Na Hee-do's daughter, quits ballet and \"runs away\" to her grandma's house. During her stay, she comes across her mother's diary, through which the story is then told.",
        "avatarName": "twenty-five-twenty-one",
        "trailerName": "twenty-five-twenty-one",
        "rating": 8.9,
        "yearOfRelease": "2022"
    },
    {
        "id": 8,
        "name": "Our Beloved Summer",
        "director": "Kim Yoon Jin",
        "casts": [
            "Choi Woo Shik",
            "Kim Da Mi",
            "Kim Sung Cheol",
            "Roh Jeong Eul",
            "Ahn Dong Goo",
            "Park Won Sang"
        ],
        "totalEpisodes": 16,
        "description": "A coming-of-age romantic comedy that revolves around Choi Ung (Choi Woo-shik) and Kook Yeon-soo (Kim Da-mi), ex-lovers who broke up with a promise to never meet again. As luck would have it, the documentary they filmed ten years ago in high school went viral and they are forced to face the cameras together again by their producer friend. The series depicts their complicated feelings and growth. This drama shows what love feels like. Instead of discussing practical issues like family conflicts, it tells a story about throb, memory and dream. Romance is revealed in many small, unnoticed acts.",
        "avatarName": "our-beloved-summer",
        "trailerName": "our-beloved-summer",
        "rating": 8.8,
        "yearOfRelease": "2021-2022"
    },
    {
        "id": 9,
        "name": "What's Wrong With Secretary Kim?",
        "director": "Park Joon Hwa",
        "casts": [
            "Park Seo Joon",
            "Park Min Young",
            "Lee Tae Hwan",
            "Kim Byeong Ok",
            "Kim Hye Ok",
            "Baek Eun Hye"
        ],
        "totalEpisodes": 16,
        "description": "Lee Young-joon (Park Seo-joon) is the vice-chairman of a major corporation. His world is shaken when, one day, his highly-capable secretary, Kim Mi-so (Park Min-young), announces that she will resign from her position after working for Lee Young-joon for nine years. Young-joon then decided to do whatever he can after talking to his best friend, who happens to be a board director in his company, to make sure Mi-so stays by his side. Throughout the journey, Lee Young-joon plans plenty of things while Kim Mi-so decides to find the elusive man from a past traumatic experience that she was a part of when she was a young child. Kim Mi-so falls in love with Lee Young-joon as they heal each other of their past traumatic experience of being kidnapped.",
        "avatarName": "what's-wrong-with-secretary-kim",
        "trailerName": "what's-wrong-with-secretary-kim",
        "rating": 8.5,
        "yearOfRelease": "2018"
    },
    {
        "id": 10,
        "name": "Strong Woman Do Bong Soon",
        "director": "Lee Hyung Min",
        "casts": [
            "Park Bo Young",
            "Park Hyung Sik",
            "Ji Soo",
            "Ahn Woo Yeon",
            "Shim Hye Jin",
            "Jeon Seok Ho",
            "Han Jung Kook"
        ],
        "totalEpisodes": 16,
        "description": "Do Bong-soon (Park Bo-young) was born with superhuman strength. Her strength is hereditary and passed along only to the women in her family. Her dream is to create a video game with herself as the main character. She desperately wants to become a delicate and elegant woman, which is the ideal type of her crush, In Guk-doo (Ji Soo), a police officer. Thanks to her strength, she gets a job as bodyguard to rich heir Ahn Min-hyuk (Park Hyung-sik), the CEO of a gaming company, Ainsoft. A series of kidnapping cases happen in Dobong-dong, the district Bong-soon lives in, and she is determined to catch the culprit, who targeted her best friend. With help and training from Min-hyuk, she manages to control her strength to use it for good causes. Min-hyuk and Bong-soon find their relationship growing into something more. Their relationship at work and in pursuit of the kidnapper creates comical and dangerous situations, which bring them closer.",
        "avatarName": "strong-woman-do-bong-soon",
        "trailerName": "strong-woman-do-bong-soon",
        "rating": 8.7,
        "yearOfRelease": "2017"
    }
]
