[
    {
        "id": 11,
        "name": "My Husband In Law",
        "director": "Aew Ampaiporn Jitmaingong",
        "casts": [
            "Mark Prin Suparat",
            "Mew Nittha Jirayungyurn",
            "Koy Rachwin Wongviriya",
            "Nut Devahastin Na Ayutthaya",
            "Yong Armchair",
            "Saimai Maneerat Sricharoon"

        ],
        "totalEpisodes": 15,
        "description": "The smart and multi-talented Muey lives with her crush, Thien, for over seven years. During that time her crush deepens into love but Thien only notices her as someone to tease and bully. He is completely oblivious to her feelings. So she resigns herself to loving him from a distance. Afterall, Thien is smart, wealthy, hard-working and good looking. His only “flaw” is being a bit of a player. Unfortunately that leads to major trouble when he sleeps with the wife of a dangerous mobster. In the aftermath, Thien’s life is in danger. To protect him, Thien’s mother forces him to marry Muey. Muey only agrees for Thien’s safety, but it is also a chance for her to be closer to him. While Thien reluctantly concedes and marries Muey, he wants to keep the relationship secret. How will their relationship fare when Muey begins working at the same company?  Is love even possible for them in these circumstances?",
        "avatarName": "my-husband-in-law",
        "trailerName": "my-husband-in-law",
        "rating": 7.8,
        "yearOfRelease": "2020"
    },
    {
        "id": 12,
        "name": "Waves Of Life",
        "director": "Aew Ampaiporn Jitmaingong",
        "casts": [
            "Mark Prin Suparat",
            "Yaya Urassaya Sperbund",
            "Louis Scott",
            "Toey Jarinporn Joonkiat",
            "Nychaa Nuttanicha Dungwattanawanich",
            "Masu Junyangdikul"
        ],
        "totalEpisodes": 15,
        "description": "Jeerawat is a hardworking woman, who is a famous model and actress. Her mother married a smarmy but rich man, who secretly lusts after her.  After he attempts to drug Jeerawat, she manages to escape by driving away. Unfortunately, she hits a young woman in the road, who later dies at the hospital. The dead young woman has a fiancee, Sathit, who happens to be a lawyer. He vows revenge on the female driver who killed his beloved fiancee. Unfortunately, Jeerawat's stepfather and mother use their influence and money to hide and hush all evidence. Sathit decides to stalk and bother her to find the evidence that she's an evil and manipulative temptress. But in the end, he finds out she's actually a good and kind person, despite her lowly beginnings, and gradually falls in love with her.",
        "avatarName": "waves-of-life",
        "trailerName": "waves-of-life",
        "rating": 8.4,
        "yearOfRelease": "2017"
    },
    {
        "id": 13,
        "name": "My Forever Sunshine",
        "director": "Chudapa Chantakett",
        "casts": [
            "Mark Prin Suparat",
            "Kao Supassara Thanachart",
            "Punjan Kawin Imanothai",
            "Lingling Sirilak Kwong",
            "Freud Chatphong Natthaphong",
            "Prawfar Karanchida Khumsuwan"
        ],
        "totalEpisodes": 19,
        "description": "The story about Paeng, a girl with a tragic life. After losing her father, she has to go live at Artit's house. The only way for her to be able to stay at this house is to be with him. But no one expected that her approaching Artit nearly costs him his life. He ends up hating her to the bones and she is exiled far from home for six years until the day they come across each other again. One might think that time will lessen hate, but not for Artit. Not only he still hates her, but he also hates her even more than before. But in order to keep her final promise to Artit's father, she must endure it!",
        "avatarName": "my-forever-sunshine",
        "trailerName": "my-forever-sunshine",
        "rating": 8.2,
        "yearOfRelease": "2020"
    },
    {
        "id": 14,
        "name": "Love Destiny",
        "director": "Mai Phawat Panangkasiri",
        "casts": [
            "Bella Ranee Campen",
            "Pope Thanawat Wattanaputi",
            "Punjan Kawin Imanothai",
            "Prang Kannarun Wongkajornklai",
            "Susi Susira Angelina Naenna",
            "Louis Scott"
        ],
        "totalEpisodes": 15,
        "description": "This is a story where karma, merit, love destiny and a moon mantra combine to fling Kadesurang, a chubby archaeologist, into the body of another woman during the Ayutthaya era (300 years earlier). In the past, the cruel and selfish Karakade was betrothed to Date, a man who despises her wickedness and prefers a kinder woman. In a fit of jealousy, Karakade tries to kill her rival, but a servant dies instead. While Karakade is suspected, her murderous intentions can’t be confirmed. So Date and his dad perform a sacred ritual to punish the killer. At this pivotal moment, Karakade dies and her spirit is replaced by Kadesurang's. After Kadesurang wakes up in Karakade's body, she is insanely curious to experience the historical context she studied. Everyone around her is confused. She acts like a completely different person: someone who has forgotten basic manners and speaks strangely, someone who suddenly wants to make merit and cares about those around her. How will the household and Karakade’s fiancée  respond to Karakade’s newly emerged optimism and responsibility coupled with such odd mannerisms? And how will Kadesurang (now Karakade) navigate this patriarchal society swirling with political unrest?",
        "avatarName": "love-destiny",
        "trailerName": "love-destiny",
        "rating": 8.5,
        "yearOfRelease": "2018"
    },
    {
        "id": 15,
        "name": "Man Of Vengeance",
        "director": "Mi Thanawat Panyarin",
        "casts": [
            "Tor Thanapob Leeratanakachorn",
            "Fern Nopjira Lerkkajornnamkul",
            "Noon Siraphan Wattanajinda",
            "Ann Siriam Pakdeedumrongrit",
            "Typhoon Kanokchat Munyadon",
            "Nicky Nachat Juntapun"
        ],
        "totalEpisodes": 27,
        "description": "Tor is a love child of a mistress and a wealthy hi-so man. After his mother dies from neglect, Tor is forced to live with his father’s family. Abused by his stepmother and stepbrother, he turns to the girl-next-door, Mingta, who also suffers neglect at the hands of her so called mother and sister. One night, while being chased by his stepmother, Tor jumps into a river and is presumed dead, though he survives. He is taken under the wing of another prostitute who knew his mother and takes on a new life under the alias, Sila. Years later, he returns as a notorious, rich pimp, with plans to avenge his mother and to get revenge for the torture and pain brought to him by his stepmother and stepbrother. Sila's main goal is to hurt the people that hurt him as a child, but he never expected to see the only friend he ever had as a child, Mingta. As soon as they see each other, she realizes that he looks familiar to her. She notices a ring he wears around his neck, and immediately comes to the conclusion that he's Tor, her childhood best friend that supposedly died. But he denies it because of his revenge plan.",
        "avatarName": "man-of-vengeance",
        "trailerName": "man-of-vengeance",
        "rating": 8.3,
        "yearOfRelease": "2019"
    },
    {
        "id": 16,
        "name": "Glass Mask",
        "director": "Jariwat Uppakharnchaiyaphat",
        "casts": [
            "Film Thanapat Kawila",
            "Nat Aniporn Chalermburanawong",
            "Captain Phutanate Hongmanop",
            "Pock Piyathida Mittiraroch",
            "Bright Norraphat Vilaiphan",
            "Maprang Alrisa Kunkwaeng"
        ],
        "totalEpisodes": 23,
        "description": "Lookkaew is a hi-so woman who is cheating on her boyfriend, Ratt. Her boyfriend catches her and walks away. When Lookkaew goes after him, she gets into a car accident and hits a girl named Natda. Lookkaew's selfish mother doesn't want to lose Ratt as a son-in-law because her daughter is in a coma and may not wake up. To fool Ratt and his father into continuing with the marriage, she has the unconscious Natda undergo plastic surgery to look like her daughter, Lookkaew. Natda wakes up and is told she is Lookkaew, but she has no memories except for what she is told by her fake mother. She also has to deal with Ratt who is angry and hurt because the real Lookkaew cheated on him. Nothing in her life feels familiar to her and even Ratt notices her personality change. Will Ratt find out the truth? Will Natda get her memories back? And what happens if the real Lookkaew wakes up?",
        "avatarName": "glass-mask",
        "trailerName": "glass-mask",
        "rating": 7.8,
        "yearOfRelease": "2018"
    },
    {
        "id": 17,
        "name": "Once Upon A Time In My Heart",
        "director": "Tle Tawan Jarujinda",
        "casts": [
            "Mik Thongraya",
            "Pim Pimprapa Tangprabhaporn",
            "Kitkong Khamkrith",
            "Mek Juti Jumroenketpratip",
            "Namwaan Kannaporn Puanthong",
            "Sa Anisa Nugraha"
        ],
        "totalEpisodes": 12,
        "description": "Fahsai is heartbroken after her ex-boyfriend cheated on her. Yet he still has the nerve to ask her to take him back so, to avoid him, Fahsai's friend took her on a trip to Japan. While she was there, Fahsai was held at gunpoint by a Hong Kong mafia named Daniel Wong. The man was shot and needed a place to stay that night so he ordered Fahsai to take him to her hotel room. And that's how their story began.",
        "avatarName": "once-upon-a-time-in-my-heart",
        "trailerName": "once-upon-a-time-in-my-heart",
        "rating": 7.8,
        "yearOfRelease": "2016"
    },
    {
        "id": 18,
        "name": "Prophecy of Love",
        "director": "Paajaew Yuthana Lorphanpaibul",
        "casts": [
            "James Jirayu Tangsrisuk",
            "Ice Preechaya Pongthananikorn",
            "Mai Warit Sirisantana",
            "Pear Pitchapa Phanthumchinda",
            "Benz Kamonchanok Rodsatien",
            "Um Apasiri Nitibhon"
        ],
        "totalEpisodes": 13,
        "description": "Rosita gets into a car accident and suddenly gets a talent where she sees the future when she touches a rose. She becomes a famous fortune teller. One day, she makes a prediction in public to reporters that Theeruth, a famous actor, will make a woman pregnant and have a secret child. That prediction gets Theeruth into trouble, and their relationship becomes antagonistic from that day.  A few years later, there is a charity event, and the host invites Theeruth and four celebrities as special guests, and also invites Rosita to tell their fortunes. The five celebrities choose different roses and give them to her to read. Once Rosita touches those roses, she sees sweet scenes of Theeruth and herself hugging, kissing and loving each other very much. She is shocked. Her reaction is so strange that the five celebrities are very curious about what she saw. Rosita does not tell anyone and claims that she saw nothing, but all the guests do not believe her.  After that day, something strange happens to her. She is attacked by someone, and the suspect is one of the five celebrities whose fortune she had read. The biggest suspect is Theeruth who had always been her opponent. But one day, he coincidentally saves her from the criminal, and also offers to let her live with him, as it is the safest place for her since everyone thinks that they are opponents. Their relationship improves little by little from that day through many dangerous situations to find the real criminal who wants to kill Rosita.",
        "avatarName": "prophecy-of-love",
        "trailerName": "prophecy-of-love",
        "rating": 7.8,
        "yearOfRelease": "2020"
    },
    {
        "id": 19,
        "name": "A Woman's Trickery",
        "director": "Worawit Khuttiyayothin",
        "casts": [
            "Sean Jindachot",
            "Esther Supreeleela",
            "Jes Jespipat Tilapornputt",
            "Gypsy Keerati Mahapreukpong",
            "Ple Jarunee Suksawat",
            "Pitchaya Chaowalit"
        ],
        "totalEpisodes": 12,
        "description": "Kate's father stole money from Sake's company and when he finds out he starts looking for Kate's father. However, Kate's father runs away.  When they find him he has to go to the hospital because of a heart condition. There, he decides to sell Kate to Sake to pay off his debts and because he knew Sake's family wanted an heir and would take care of Kate. Sake gradually begins to fall in love with Kate.  Meanwhile, Sake's ex-wife Itsala doesn't believe Sake has moved on to Kate and continuously chases after him.",
        "avatarName": "a-woman-trickery",
        "trailerName": "a-woman-trickery",
        "rating": 7.8,
        "yearOfRelease": "2015"
    },
    {
        "id": 20,
        "name": "Pink Sin",
        "director": "Nine Sarasawadee Wongsompetch",
        "casts": [
            "Pon Nawasch Phupantachsee",
            "Bua Nalinthip Sakulongumpai",
            "Gard Pirapob Ardviboonporn",
            "Sirinart Sugandharat",
            "Build Jakapan Puttha",
            "Morakot Liu"
        ],
        "totalEpisodes": 24,
        "description": "Patsakorn is the only heir of a millionaire who hides his cruel coldness under his good looks. He started to act out toward his father after his mother died.  When Kangsadan enters his life, he cannot hide his interest in this kind and sassy girl. But his world begins to twirl upside down when his father brings home the exact girl (he is interested in) and her mother home and decides that they will live with Peat and his father as a family because of Khun Sa being sick. With resentment in his heart, Patsakorn decided to turn his back on his family. After four years, he returned in order to take everything back, and Kangsadan will be the first person he takes revenge on. But throughout the series, he and Kangsadan start to fall in love with each other but because of his resentment towards his father for not being there for his mother, He continues to be heartless and selfish towards Kangsadan by treating her very badly and trying to make her jealous. ",
        "avatarName": "pink-sin",
        "trailerName": "pink-sin",
        "rating": 7.7,
        "yearOfRelease": "2018"
    }
]
